In [1]:
j = 49
k = 89
g = 'Week 2 assignment, Yeah!!! Woooooo'

In [2]:
print j + k, g

138 Week 2 assignment, Yeah!!! Woooooo

In [3]:
j = k = 6

In [4]:
print j,k

6 6

In [5]:
#Mathematical functions

In [6]:
(50*2)+40-2

138

In [7]:
print round(137.8)

138.0

In [8]:
print round (138.801, 2)

138.8

In [9]:
print cmp(2,3)

-1

In [10]:
print cmp(138,276)
print cmp(276,138)

-1
1

In [11]:
print range(5)
print range(2,8)
print range(2,138,8)

[0, 1, 2, 3, 4]
[2, 3, 4, 5, 6, 7]
[2, 10, 18, 26, 34, 42, 50, 58, 66, 74, 82, 90, 98, 106, 114, 122, 130]

In [12]:
string1 = "I am"
string2 = "lots"
string3 = "learning"

In [13]:
print string1, string3, string2

I am learning lots

In [14]:
c = []

In [15]:
print type(c)
print isinstance(c,list)

<type 'list'>
True

In [16]:
strangerthings = ['mewmew', 'bob',5]

In [17]:
print strangerthings[1]

bob

In [18]:
print strangerthings[2]

5

In [19]:
season2 = ['eggo', 'hawkins',3]

In [20]:
good = [strangerthings, season2]

In [21]:
print good

[['mewmew', 'bob', 5], ['eggo', 'hawkins', 3]]

In [22]:
num = [0,1,2,3,4,5,6,7,8,9]

In [23]:
print num[0:6]
print num[6:]

[0, 1, 2, 3, 4, 5]
[6, 7, 8, 9]

In [24]:
#pandas

In [2]:
import pandas as pd
import datetime

In [33]:
from pandas import Series, DataFrame

In [34]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [3]:
# create a list containing dates from 12-01 to 12-07
dt = datetime.datetime(2017,12,1)
end = datetime.datetime(2017,12,8)
step = datetime.timedelta(days=1)
dates = []

In [4]:
# populate the list
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [5]:
dates

['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07']

In [16]:
d = {'Date': dates, 'Tokyo' : [15,19,15,11,9,8,13], 'The Upside Down': [-6,-6,-6,-6,-6,-6,-6], 'Toronto':[2,4,-1,7,4,3,-2]}

In [17]:
d

{'Date': ['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07'],
 'The Upside Down': [-6, -6, -6, -6, -6, -6, -6],
 'Tokyo': [15, 19, 15, 11, 9, 8, 13],
 'Toronto': [2, 4, -1, 7, 4, 3, -2]}

In [18]:
temps = pd.DataFrame(d)

In [19]:
ntemp = temps['The Upside Down']

In [20]:
temps

    Date  The Upside Down  Tokyo  Toronto
0  12-01               -6     15        2
1  12-02               -6     19        4
2  12-03               -6     15       -1
3  12-04               -6     11        7
4  12-05               -6      9        4
5  12-06               -6      8        3
6  12-07               -6     13       -2

In [21]:
#reading CSV File to create data frame

In [29]:
drinks = pd.read_csv('../data/drinks.csv')
print drinks

                  country  beer_servings  spirit_servings  wine_servings  \
0             Afghanistan              0                0              0
1                 Albania             89              132             54
2                 Algeria             25                0             14
3                 Andorra            245              138            312
4                  Angola            217               57             45
5       Antigua & Barbuda            102              128             45
6               Argentina            193               25            221
7                 Armenia             21              179             11
8               Australia            261               72            212
9                 Austria            279               75            191
10             Azerbaijan             21               46              5
11                Bahamas            122              176             51
12                Bahrain             42               63              7
13             Bangladesh              0                0              0
14               Barbados            143              173             36
15                Belarus            142              373             42
16                Belgium            295               84            212
17                 Belize            263              114              8
18                  Benin             34                4             13
19                 Bhutan             23                0              0
20                Bolivia            167               41              8
21     Bosnia-Herzegovina             76              173              8
22               Botswana            173               35             35
23                 Brazil            245              145             16
24                 Brunei             31                2              1
25               Bulgaria            231              252             94
26           Burkina Faso             25                7              7
27                Burundi             88                0              0
28          Cote d'Ivoire             37                1              7
29             Cabo Verde            144               56             16
..                    ...            ...              ...            ...
163              Suriname            128              178              7
164             Swaziland             90                2              2
165                Sweden            152               60            186
166           Switzerland            185              100            280
167                 Syria              5               35             16
168            Tajikistan              2               15              0
169              Thailand             99              258              1
170             Macedonia            106               27             86
171           Timor-Leste              1                1              4
172                  Togo             36                2             19
173                 Tonga             36               21              5
174     Trinidad & Tobago            197              156              7
175               Tunisia             51                3             20
176                Turkey             51               22              7
177          Turkmenistan             19               71             32
178                Tuvalu              6               41              9
179                Uganda             45                9              0
180               Ukraine            206              237             45
181  United Arab Emirates             16              135              5
182        United Kingdom            219              126            195
183              Tanzania             36                6              1
184                   USA            249              158             84
185               Uruguay            115               35            220
186            Uzbekistan             25              101              8
187               Vanuatu             21               18             11
188             Venezuela            333              100              3
189               Vietnam            111                2              1
190                 Yemen              6                0              0
191                Zambia             32               19              4
192              Zimbabwe             64               18              4

     total_litres_of_pure_alcohol continent
0                             0.0        AS
1                             4.9        EU
2                             0.7        AF
3                            12.4        EU
4                             5.9        AF
5                             4.9       NAm
6                             8.3        SA
7                             3.8        EU
8                            10.4        OC
9                             9.7        EU
10                            1.3        EU
11                            6.3       NAm
12                            2.0        AS
13                            0.0        AS
14                            6.3       NAm
15                           14.4        EU
16                           10.5        EU
17                            6.8       NAm
18                            1.1        AF
19                            0.4        AS
20                            3.8        SA
21                            4.6        EU
22                            5.4        AF
23                            7.2        SA
24                            0.6        AS
25                           10.3        EU
26                            4.3        AF
27                            6.3        AF
28                            4.0        AF
29                            4.0        AF
..                            ...       ...
163                           5.6        SA
164                           4.7        AF
165                           7.2        EU
166                          10.2        EU
167                           1.0        AS
168                           0.3        AS
169                           6.4        AS
170                           3.9        EU
171                           0.1        AS
172                           1.3        AF
173                           1.1        OC
174                           6.4       NAm
175                           1.3        AF
176                           1.4        AS
177                           2.2        AS
178                           1.0        OC
179                           8.3        AF
180                           8.9        EU
181                           2.8        AS
182                          10.4        EU
183                           5.7        AF
184                           8.7       NAm
185                           6.6        SA
186                           2.4        AS
187                           0.9        OC
188                           7.7        SA
189                           2.0        AS
190                           0.1        AS
191                           2.5        AF
192                           4.7        AF

[193 rows x 6 columns]

In [31]:
print drinks.beer_servings.value_counts()

0      15
5       5
6       4
31      4
25      4
9       4
21      4
1       4
77      3
8       3
52      3
36      3
82      2
149     2
42      2
51      2
343     2
32      2
56      2
193     2
194     2
62      2
245     2
15      2
224     2
19      2
263     2
93      2
76      2
16      2
       ..
89      1
163     1
249     1
347     1
92      1
98      1
99      1
102     1
361     1
106     1
109     1
111     1
115     1
376     1
122     1
124     1
127     1
128     1
130     1
133     1
140     1
142     1
143     1
144     1
147     1
152     1
157     1
159     1
162     1
346     1
Name: beer_servings, Length: 130, dtype: int64

In [ ]:
#Data Structure Example

In [36]:
obj = pd.Series([1, 2, 4, -3])
obj

0    1
1    2
2    4
3   -3
dtype: int64

In [40]:
obj.index  # like range(5)

RangeIndex(start=0, stop=4, step=1)

In [41]:
obj2 = pd.Series([1, 2, 4, -3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [42]:
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c   -3
a    4
d    6
dtype: int64

In [43]:
obj2[obj2 > 0]
obj2 * 2
np.exp(obj2)

d    403.428793
b      7.389056
a     54.598150
c      0.049787
dtype: float64

In [44]:
'b' in obj2
'e' in obj2

False

In [46]:
sdata = {'Kitchener': 31000, 'Toronto': 100000, 'Scarborough': 11000, 'Mississauga': 2000}
obj3 = pd.Series(sdata)
obj3

Kitchener       31000
Mississauga      2000
Scarborough     11000
Toronto        100000
dtype: int64

In [49]:
cities = ['London', 'Toronto', 'Scarborough', 'Mississauga']
obj4 = pd.Series(sdata, index=cities)
obj4

London              NaN
Toronto        100000.0
Scarborough     11000.0
Mississauga      2000.0
dtype: float64

In [50]:
pd.isnull(obj4)
pd.notnull(obj4)

London         False
Toronto         True
Scarborough     True
Mississauga     True
dtype: bool

In [51]:
obj4.isnull()

London          True
Toronto        False
Scarborough    False
Mississauga    False
dtype: bool

In [52]:
obj3+obj4

Kitchener           NaN
London              NaN
Mississauga      4000.0
Scarborough     22000.0
Toronto        200000.0
dtype: float64

In [53]:
obj4.name = 'population'
obj4.index.name = 'cities'
obj4

cities
London              NaN
Toronto        100000.0
Scarborough     11000.0
Mississauga      2000.0
Name: population, dtype: float64

In [54]:
#Indexing a pandas Dataframe

In [83]:
data = {'business_unit': ['Solid Waste', 'Solid Waste', 'Construction', 'Construction'],
        'year': ['2014', '2015', '2014', '2015'],
        'EE count': ['250', '500', '450', '600']}
frame = pd.DataFrame(data)

In [84]:
frame

  EE count business_unit  year
0      250   Solid Waste  2014
1      500   Solid Waste  2015
2      450  Construction  2014
3      600  Construction  2015

In [85]:
frame.head()

  EE count business_unit  year
0      250   Solid Waste  2014
1      500   Solid Waste  2015
2      450  Construction  2014
3      600  Construction  2015

In [87]:
pd.DataFrame(data, columns=['EE count', 'business_unit', 'year'])

  EE count business_unit  year
0      250   Solid Waste  2014
1      500   Solid Waste  2015
2      450  Construction  2014
3      600  Construction  2015

In [89]:
frame2 = pd.DataFrame(data, columns=['EE count', 'business_unit', 'year', 'turnover'],
                      index=['one', 'two', 'three', 'four'])
frame2
frame2.columns

Index([u'EE count', u'business_unit', u'year', u'turnover'], dtype='object')

In [90]:
frame2['business_unit']
frame2.year

one      2014
two      2015
three    2014
four     2015
Name: year, dtype: object

In [91]:
frame2['turnover'] = 5
frame2
frame2['turnover'] = np.arange(4.)
frame2

      EE count business_unit  year  turnover
one        250   Solid Waste  2014       0.0
two        500   Solid Waste  2015       1.0
three      450  Construction  2014       2.0
four       600  Construction  2015       3.0

In [74]:
val = pd.Series([-4, -5, -3], index=['one', 'three', 'four'])
frame2['turnover'] = val
frame2

      EE count business unit  year  turnover
one        250   Solid Waste  2014      -4.0
two        500   Solid Waste  2015       NaN
three      450  Construction  2014      -5.0
four       600  Construction  2015      -3.0

In [94]:
frame2['Infrastructure'] = frame2.business_unit == 'Construction'
frame2

      EE count business_unit  year  turnover  Infrastructure
one        250   Solid Waste  2014       0.0           False
two        500   Solid Waste  2015       1.0           False
three      450  Construction  2014       2.0            True
four       600  Construction  2015       3.0            True

In [95]:
del frame2['Infrastructure']
frame2.columns

Index([u'EE count', u'business_unit', u'year', u'turnover'], dtype='object')

In [96]:
pop = {'Solid Waste': {2014: 250, 2015: 500},
       'Construction': {2014: 450, 2015: 600}}

In [97]:
frame3 = pd.DataFrame(pop)
frame3

      Construction  Solid Waste
2014           450          250
2015           600          500

In [98]:
frame3.T

              2014  2015
Construction   450   600
Solid Waste    250   500

In [100]:
pd.DataFrame(pop, index=[2014, 2015])

      Construction  Solid Waste
2014           450          250
2015           600          500

In [101]:
pdata = {'Construction': frame3['Construction'][:-1],
         'Solid Waste': frame3['Solid Waste'][:2]}
pd.DataFrame(pdata)

      Construction  Solid Waste
2014         450.0          250
2015           NaN          500

In [104]:
frame3.index.name = 'year'; frame3.columns.name = 'business_unit'
frame3

business_unit  Construction  Solid Waste
year
2014                    450          250
2015                    600          500

In [105]:
frame3.values

array([[450, 250],
       [600, 500]])

In [106]:
frame2.values

array([['250', 'Solid Waste', '2014', 0.0],
       ['500', 'Solid Waste', '2015', 1.0],
       ['450', 'Construction', '2014', 2.0],
       ['600', 'Construction', '2015', 3.0]], dtype=object)